# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

![e_commerce%20_schema.png](attachment:e_commerce%20_schema.png)

### Load Required Libraries

In [58]:
import mysql.connector
import pandas as pd

### Connect to DB using Mysql-connector-python package

In [ ]:
connection = mysql.connector.connect(host = "localhost",
                                    user = "root",
                                    passwd= "Y0gendr@")
cursorObject = connection.cursor()
connection.close()

### You are required to create a database named 'e_commerce'

In [ ]:
connection = mysql.connector.connect(host = "localhost",
                                    user = "root",
                                    passwd= "Y0gendr@")
cursorObject = connection.cursor()
cursorObject.execute("Create DATABASE e_commerce")
connection.close()

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [59]:
connection = mysql.connector.connect(host = "localhost",
                                    user = "root",
                                    passwd= "Y0gendr@",
                                    database="e_commerce")

cursorObject = connection.cursor()

In [ ]:
#cursorObject.execute("DROP TABLE IF EXISTS supplier")
supplier = """Create TABLE supplier(
            SUPP_ID int primary key,
            SUPP_NAME varchar(50),
            SUPP_CITY varchar(50),
            SUPP_PHONE varchar(10))
            """
cursorObject.execute(supplier)

In [ ]:
customer = """create Table customer(
            CUS_ID INT NOT NULL,
            CUS_NAME VARCHAR(20) NULL DEFAULT NULL,
            CUS_PHONE VARCHAR(10),
            CUS_CITY varchar(30),
            CUS_GENDER CHAR,
            PRIMARY KEY (CUS_ID)
            )
            """
cursorObject.execute(customer)

In [ ]:
category = """create Table category(
            CAT_ID INT NOT NULL,
            CAT_NAME VARCHAR(20) NULL DEFAULT NULL,
            PRIMARY KEY (CAT_ID)
            )
            """
cursorObject.execute(category)

In [ ]:
product = """create Table product(
            PRO_ID INT NOT NULL,
            PRO_NAME VARCHAR(20) NULL DEFAULT NULL,
            PRO_DESC VARCHAR(60) NULL DEFAULT NULL,
            CAT_ID INT NOT NULL,
            PRIMARY KEY (PRO_ID),
            FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID)
            )
            """
cursorObject.execute(product)

In [ ]:
product_details = """create Table product_details(
            PROD_ID INT NOT NULL,
            PRO_ID INT NOT NULL,
            SUPP_ID INT NOT NULL,
            PROD_PRICE INT NOT NULL,
            PRIMARY KEY (PROD_ID),
            FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID),
            FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID)
            )
            """
cursorObject.execute(product_details)

In [ ]:
order = """create Table orders(
            ORD_ID INT NOT NULL,
            ORD_AMOUNT FLOAT NOT NULL,
            ORD_DATE DATE,
            CUS_ID INT NOT NULL,
            PROD_ID INT NOT NULL,
            PRIMARY KEY (ORD_ID),
            FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),
            FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID)
            )
            """
cursorObject.execute(order)

In [ ]:
rating = """create Table rating(
            RAT_ID INT NOT NULL,
            CUS_ID INT NOT NULL,
            SUPP_ID INT NOT NULL,
            RAT_RATSTARS INT NOT NULL,
            PRIMARY KEY (RAT_ID),
            FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),
            FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))
            """
cursorObject.execute(rating)

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [ ]:
# insert into "supplier" table
insert_supplier = "Insert into supplier(SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE) VALUES (%s, %s, %s, %s)"
val = [(1, "Rajesh Retails", "Delhi",1234567890),
       (2, "Appario Ltd.", "Mumbai",258963147),
       (3, "Knome products", "Bangalore",9785462315),
       (4, "Bansal Retails", "Kochi",8975463285),
        (5, "Mittal Ltd.", "Lucknow",7898456532)]
cursorObject.executemany(insert_supplier, val)
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [ ]:
# insert into "customer" table
insert_customer = "Insert into customer(CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER) VALUES (%s, %s, %s, %s, %s)"
val = [(1, "Aakash", 9999999999,"Delhi", "M"),
       (2, "Aman", 9285468565,"Noida","M"),
       (3, "Neha", 9564984655,"Mumbai", "F"),
       (4, "Megha", 8975237285, "Kolkata","F"),
       (5, "Pulkit", 7898456532, "Lucknow","M")]
cursorObject.executemany(insert_customer, val)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [ ]:
# insert into "categoty" table
insert_cat = "insert into category (CAT_ID, CAT_NAME) values (%s, %s)"
val = [(1, "Books"),
       (2, "Games"), 
       (3, "Groceries"),
       (4, "Electronics"), 
       (5, "Clothes")]

cursorObject.executemany(insert_cat,val)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [ ]:
# insert into "product" table
insert_product = "Insert into product(PRO_ID, PRO_NAME, PRO_DESC, CAT_ID) VALUES (%s, %s, %s, %s)"
val = [(1,"GTA V", "DFJDJFDJFDJFDJFJF",2),
       (2, "TShirt", "DFDFJDFJDKFD",5),
       (3, "Rog Laptop", "DFNTTNTNTERND", 4),
       (4, "OATS", "REURENTBTOTH", 3),
       (5,"Harry Potter", "NBEMCTHTJTH", 1)]

cursorObject.executemany(insert_product, val)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [ ]:
# insert into "product_details" table
insert_product_details = "Insert into product_details(PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE) VALUES (%s, %s, %s, %s)"
val = [(1, 1, 2, 1500),
       (2, 3, 5, 30000),
       (3, 5, 1, 3000),
       (4, 2, 3, 2500),
       (5, 4, 1, 1000)]

cursorObject.executemany(insert_product_details, val)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [ ]:
# insert into "orders" table
insert_orders = "Insert into orders(ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES (%s, %s, %s, %s, %s)"
val = [(20, 1500, "2021-10-12", 3, 5),
       (25, 30500, "2021-09-16", 5, 2),
       (26, 2000, "2021-10-05", 1, 1),
       (30, 3500, "2021-08-16", 4, 3),
       (50, 2000, "2021-10-06", 2, 1)]

cursorObject.executemany(insert_orders, val)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [ ]:
# insert into "rating" table
insert_rating = "Insert into rating(RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES (%s, %s, %s, %s)"
val = [(1, 2, 2, 4),
       (2, 3, 4, 3),
       (3, 5, 1, 5),
       (4, 1, 3, 2),
       (5, 4, 5, 4)]

cursorObject.executemany(insert_rating, val)
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [3]:
select_query = """
SELECT customer.CUS_GENDER, count(customer.CUS_GENDER) as Gender_Count from customer
INNER JOIN orders 
ON customer.CUS_ID = orders.CUS_ID
WHERE orders.ORD_AMOUNT >=3000
GROUP BY customer.CUS_GENDER                
"""
cursorObject.execute(select_query)
output = cursorObject.fetchall()
output_df = pd.DataFrame(output, columns = ['GENDER', 'COUNT'])
output_df

  GENDER  COUNT
0      M      1
1      F      1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [4]:
select_query = """
SELECT orders.CUS_ID, orders.ORD_DATE, orders.ORD_AMOUNT, product.PRO_NAME from orders
INNER JOIN product
ON orders.PROD_ID = product.PRO_ID
WHERE orders.CUS_ID=2
"""
cursorObject.execute(select_query)
output = cursorObject.fetchall()
#print(output)
output_df = pd.DataFrame(output, columns = ['Customer_Id', 'Order_Date', 'Order_Amount', 'Product_Name'])
output_df

   Customer_Id  Order_Date  Order_Amount Product_Name
0            2  2021-10-06        2000.0        GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [5]:
select_query = """
SELECT supplier.* from supplier
WHERE supplier.SUPP_ID
IN (SELECT product_details.SUPP_ID
FROM product_details
GROUP BY product_details.SUPP_ID
HAVING COUNT(product_details.SUPP_ID) > 1)
"""
cursorObject.execute(select_query)
output = cursorObject.fetchall()
#print(output)
output_df = pd.DataFrame(output, columns = ['Supplier_Id', 'Name', 'City', 'Contact'])
output_df

   Supplier_Id            Name   City     Contact
0            1  Rajesh Retails  Delhi  1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [60]:
#product,orders and product and category 
select_query6 = """select category.*, orders.ORD_AMOUNT
FROM category INNER JOIN product
ON category.CAT_ID=product.CAT_ID
INNER JOIN product_details
ON product_details.PROD_ID=product.PRO_ID
INNER JOIN orders
ON orders.PROD_ID=product.PRO_ID
WHERE orders.ORD_AMOUNT IN (SELECT MIN(orders.ORD_AMOUNT) FROM orders)
"""
cursorObject.execute(select_query6)
output = cursorObject.fetchall()
#print(output)
output_df = pd.DataFrame(output, columns = ['Category_Id', 'Category_Name', 'Order_Amount'])
output_df

   Category_Id Category_Name  Order_Amount
0            1         Books        1500.0

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [15]:
select_query7 = """SELECT product.PRO_ID, product.PRO_NAME
FROM product 
INNER JOIN orders
ON orders.PROD_ID=product.PRO_ID
WHERE orders.ORD_DATE >= "2021-10-05"
GROUP BY product.PRO_ID
"""
cursorObject.execute(select_query7)
output = cursorObject.fetchall()
#print(output)
output_df = pd.DataFrame(output, columns = ['Product_Id', 'Product_Name'])
output_df

   Product_Id  Product_Name
0           5  Harry Potter
1           1         GTA V

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [46]:
select_query8 = """SELECT supplier.SUPP_ID, supplier.SUPP_NAME, customer.CUS_NAME, rating.RAT_RATSTARS
FROM supplier 
INNER JOIN rating
ON supplier.SUPP_ID=rating.SUPP_ID
INNER JOIN customer
ON customer.CUS_ID=rating.CUS_ID
ORDER BY rating.RAT_RATSTARS desc limit 3
"""
cursorObject.execute(select_query8)
output = cursorObject.fetchall()
#print(output)
output_df = pd.DataFrame(output, columns = ['Supplier_Id', 'Supplier_Name', 'Customer_Name', 'Rating'])
output_df

   Supplier_Id   Supplier_Name Customer_Name  Rating
0            1  Rajesh Retails        Pulkit       5
1            2    Appario Ltd.          Aman       4
2            5     Mittal Ltd.         Megha       4

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [50]:
select_query9 = """SELECT customer.CUS_NAME, customer.CUS_GENDER
FROM customer 
WHERE customer.CUS_NAME like 'A%' OR customer.CUS_NAME like '%A'
"""
cursorObject.execute(select_query9)
output = cursorObject.fetchall()
#print(output)
output_df = pd.DataFrame(output, columns = ['Name', 'Gender'])
output_df

     Name Gender
0  Aakash      M
1    Aman      M
2    Neha      F
3   Megha      F

### Q10) Display the total order amount of the male customers.

In [53]:
select_query10 = """SELECT SUM(orders.ORD_AMOUNT)
FROM orders
INNER JOIN customer
ON customer.CUS_ID=orders.CUS_ID
WHERE customer.CUS_GENDER='M';
"""
cursorObject.execute(select_query10)
output = cursorObject.fetchall()
#print(output)
output_df = pd.DataFrame(output, columns = ['Total Order Amount Of Male Customers'])
output_df

   Total Order Amount Of Male Customers
0                               34500.0

### Q11) Display all the Customers left outer join with  the orders

In [55]:
select_query11 = """SELECT customer.*
FROM customer
LEFT JOIN orders
ON orders.CUS_ID=customer.CUS_ID
"""
cursorObject.execute(select_query11)
output = cursorObject.fetchall()
#print(output)
output_df = pd.DataFrame(output, columns = ['ID', 'Name', 'Phone', 'City', 'Gender'])
output_df

   ID    Name       Phone     City Gender
0   1  Aakash  9999999999    Delhi      M
1   2    Aman  9285468565    Noida      M
2   3    Neha  9564984655   Mumbai      F
3   4   Megha  8975237285  Kolkata      F
4   5  Pulkit  7898456532  Lucknow      M

In [61]:
connection.close()

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)